In [122]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [123]:
# %pip install xlrd

In [124]:
df = pd.read_excel('archive/titanic3.xls')

In [125]:
df.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [126]:
df.shape

(1309, 14)

In [127]:
df.drop(['name', 'boat', 'body', 'home.dest'], axis = 1, inplace=True)

In [128]:
df.head()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,female,29.0000,0,0,24160,211.3375,B5,S
1,1,1,male,0.9167,1,2,113781,151.5500,C22 C26,S
2,1,0,female,2.0000,1,2,113781,151.5500,C22 C26,S
3,1,0,male,30.0000,1,2,113781,151.5500,C22 C26,S
4,1,0,female,25.0000,1,2,113781,151.5500,C22 C26,S

In [129]:
df.shape

(1309, 10)

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   survived  1309 non-null   int64
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 102.4+ KB

In [131]:
df.isnull().sum()

pclass         0
survived       0
sex            0
age          263
sibsp          0
parch          0
ticket         0
fare           1
cabin       1014
embarked       2
dtype: int64

In [132]:
columns = df.columns[df.isnull().any(axis = 0)]

In [133]:
columns

Index(['age', 'fare', 'cabin', 'embarked'], dtype='object')

In [134]:
print(type(df.mode()))
print(type(df['pclass'].mode()))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [135]:
for column in df.columns:
    df[column].fillna(df[column].mode()[0], inplace=True)

In [136]:
df.isnull().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
ticket      0
fare        0
cabin       0
embarked    0
dtype: int64

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   survived  1309 non-null   int64
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   cabin     1309 non-null   object
 9   embarked  1309 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 102.4+ KB

In [138]:
df.describe()

,pclass,survived,age,sibsp,parch,fare
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000
mean,2.294882,0.381971,28.699516,0.498854,0.385027,33.276193
std,0.837836,0.486055,13.097103,1.041658,0.865560,51.743584
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000
25%,2.000000,0.000000,22.000000,0.000000,0.000000,7.895800
50%,3.000000,0.000000,24.000000,0.000000,0.000000,14.454200
75%,3.000000,1.000000,35.000000,1.000000,0.000000,31.275000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200

In [139]:
# df['row_number'] = df.reset_index().index + 1

In [140]:
x = df
y = df.pop('survived')

In [141]:
# Select only categorical columns
categorical_columns = x.select_dtypes(include=['object'])

# Convert categorical columns to strings
categorical_columns = categorical_columns.astype(str)

In [142]:
float_int_column = x.select_dtypes(include = ['float', 'int']).columns

In [143]:
print(categorical_columns.head())
categorical_columns.shape

      sex  ticket    cabin embarked
0  female   24160       B5        S
1    male  113781  C22 C26        S
2  female  113781  C22 C26        S
3    male  113781  C22 C26        S
4  female  113781  C22 C26        S

(1309, 4)

In [144]:
encoded_categorical_columns = pd.get_dummies(categorical_columns)

In [145]:
categorical_columns.shape

(1309, 4)

In [146]:
print(encoded_categorical_columns.shape)
encoded_categorical_columns.head()
encoded_categorical_columns = encoded_categorical_columns.astype(float)

(1309, 1120)

In [147]:
x_encoded = x.select_dtypes(include=['float', 'int'])

In [148]:
print(encoded_categorical_columns.shape)
print(x_encoded.shape)

(1309, 1120)
(1309, 5)

In [149]:
x = pd.concat([x_encoded.reset_index(drop=True), encoded_categorical_columns.reset_index(drop=True)], axis=1)

In [150]:
x.head()

,pclass,age,sibsp,parch,fare,sex_female,sex_male,ticket_110152,ticket_110413,ticket_110465,...,cabin_F G73,cabin_F2,cabin_F33,cabin_F38,cabin_F4,cabin_G6,cabin_T,embarked_C,embarked_Q,embarked_S
0,1,29.0000,0,0,211.3375,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1,1,0.9167,1,2,151.5500,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
2,1,2.0000,1,2,151.5500,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
3,1,30.0000,1,2,151.5500,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
4,1,25.0000,1,2,151.5500,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0

In [151]:
# delete the one columns that are encoded in both dataframes to avoid multicollinearity 
x.drop(['embarked_S'], axis = 'columns', inplace=True)

In [152]:
x.shape

(1309, 1124)

In [153]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, random_state=0, train_size = 0.8)

In [154]:
from sklearn.preprocessing import StandardScaler
scale = StandardScaler()

In [155]:
# only transform float columns that are in float_int_column
x_train[float_int_column] = scale.fit_transform(x_train[float_int_column])

In [156]:
x_test[float_int_column] = scale.transform(x_test[float_int_column])

# Regression Model: Random Forest
# Ensemble Method: Bagging

In [157]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier(n_estimators=100, random_state=0)

In [158]:
classifier.fit(x_train, y_train)

RandomForestClassifier(random_state=0)

In [159]:
classifier.predict(x_test)

array([0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0,
       0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0],
      dtype=int64)

In [160]:
classifier.score(x_test, y_test)

0.8244274809160306

In [161]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, classifier.predict(x_test))

In [162]:
cm

array([[150,  12],
       [ 34,  66]], dtype=int64)

In [163]:
graph = pd.DataFrame(cm, index=['Survived', 'Not Survived'], columns=['Survived', 'Not Survived'])
graph

              Survived  Not Survived
Survived           150            12
Not Survived        34            66

In [164]:
# recall and precision
from sklearn.metrics import recall_score, precision_score
recall = recall_score(y_test, classifier.predict(x_test))
precision = precision_score(y_test, classifier.predict(x_test))

recall, precision

(0.66, 0.8461538461538461)